Arlberghaus_Strom.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:amis="amis:com.siemens.ptd.amis">
   <soapenv:Header/>
   <soapenv:Body>
      <amis:CompoundCallGetTariff>
         <amis:std>
            <amis:request>Project_EWA_14</amis:request>
            <!--Optional:-->
            <amis:comment>no</amis:comment>
            <!--Optional:-->
            <amis:blockSize>0</amis:blockSize>
            <amis:activationTime>2017-07-17T04:00:00+02:00</amis:activationTime>
            <!--Optional:-->
            <amis:async>
               <amis:deliveryTime>2017-07-18T22:00:00+02:00</amis:deliveryTime>
               <!--Optional:-->
               <amis:responseUrl>ResponseEWA</amis:responseUrl>
            </amis:async>
            <!--You have a CHOICE of the next 4 items at this level-->
            <amis:device>100000148</amis:device>
         </amis:std>
         <amis:tariffType>actual</amis:tariffType>
         <amis:allObis>true</amis:allObis>
      </amis:CompoundCallGetTariff>
   </soapenv:Body>
</soapenv:Envelope>


2017-07-17 11:07:10.929131
2017-07-17 11:07:10.929154


pi@raspberrypi:~/software/data $ vim Arlberghaus.xml
pi@raspberrypi:~/software/data $ sudo vim test_xml.py

import xml.etree.ElementTree as ET
tree = ET.parse("Arlberghaus_Strom.xml")
root = tree.getroot()

for child in root.iter():
print child.tag, child.attrib
#{http://schemas.xmlsoap.org/soap/envelope/}Envelope {}
#{http://schemas.xmlsoap.org/soap/envelope/}Header {}
#{http://schemas.xmlsoap.org/soap/envelope/}Body {}
#{amis:com.siemens.ptd.amis}CompoundCallGetTariff {}
#{amis:com.siemens.ptd.amis}std {}
#{amis:com.siemens.ptd.amis}request {}
#{amis:com.siemens.ptd.amis}comment {}
#{amis:com.siemens.ptd.amis}blockSize {}
#{amis:com.siemens.ptd.amis}activationTime {}
#{amis:com.siemens.ptd.amis}async {}
#{amis:com.siemens.ptd.amis}deliveryTime {}
#{amis:com.siemens.ptd.amis}responseUrl {}
#{amis:com.siemens.ptd.amis}device {}
#{amis:com.siemens.ptd.amis}tariffType {}
#{amis:com.siemens.ptd.amis}allObis {}


for child in root.iter('{amis:com.siemens.ptd.amis}request'):
id = "12345678"
child.text = id


tree = ET.ElementTree(root)
with open("Arlberghaus.xml", "w") as f:
tree.write(f)






{amis:com.siemens.ptd.amis}activationTime
{amis:com.siemens.ptd.amis}activationTime